Revit 2027 API
CoordinatePlaneVisibility Enumeration
 Visibility settings for ReferencePoint element's coordinate reference planes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CoordinatePlaneVisibility
Public Enumeration CoordinatePlaneVisibility
public enum class CoordinatePlaneVisibility
type CoordinatePlaneVisibility
Members
Member name | Value | Description
Always | 2 |  Always Visible.
Never | 0 |  Never visible.
WhenSelected | 1 |  Visible when selected.
See Also
Reference
Autodesk.Revit.DB Namespace